#include <iostream>
using namespace std;
int main() {
	setlocale(LC_ALL, "RUS");
	// вывести числа 1 2 3 4 5 
	/*for (int i = 1; i <= 5; i = i + 1) {
		cout << i << endl;
	}*/
	// вывести числа 5 4 3 2 1 
	/*for (int i = 5; i >= 1; i = i - 1) {
		cout << i << endl;
	}*/
	// вывести только четные от -10 до 10
	/*for (int i = -10; i >= 10; i = i + 2 ) {
		cout << i << endl;
	}*/
	// вывести сумму чисел 1 2 3 4 5 
	//int s = 0
	/*for (int i = 1; i <= 5; i = i + 1) {
	s = s + i ; 
		cout << s << endl;
	}*/
	//вывести таблицу умножения на 3 в виде
	//3*1=3
	/*or (int i = 1; i <= 10; i = i + 1) {
		cout << "3*" << i << "=" <<3*i<<  endl;
	}*/
	//3*2=6
	//4 задача
	/*int n,x;
	cin >> n;
	int kp = 0;
	for (int i = 1; i <= n; i = i + 1);
	cin >> x;
	if (x > 0) {
		kp++;
	}
	else if ( x == 0){
	kz++;
	}
	else if ( x < 0){
	kn++;
	}
	cout << x << endl;
	*/
	// Составьте программу, выводящую на экран квадраты чисел от 10 до 20.
	/*for (int i = 10; i <= 20; i = i + 1) {
		cout << i * i << endl;
	}*/
	//2. Составьте программу, котораЯ вычисляет сумму чисел от 1 до n.значение n вводится с клавиатуры.
	/*int n;
	cin >> n;
	for (int i = 1; i <= 20; i = n + 1) {
		cout << i << endl;
	}*/	
	//3. Составьте программу, составьте программу, которая вычисляет произведение чисел от 1 до n.n вводится с клавиатуры.
	/*int n;
	cin >> n;
	for (int i = 1; i <= 20; i = n * 1) {
		cout << i << endl;
	}*/
}